<!-- Generated by https://github.com/rodion-gudz/YandexLyceumDocs -->

<!DOCTYPE html>
<html lang="ru">
<head>
    <meta charset="UTF-8">
    <title>Задача "Со всех ног" </title>
    <link rel="stylesheet" href="/css/client.css"/>
	<link rel="stylesheet" href="/css/vendors.css">
	<link rel="stylesheet" href="/css/prism.css"/>
</head>
<body>
	<div class="layout">
		<div class="layout__wrapper layout__wrapper_type_narrow">
			<main class="layout__main"><a
					class="nav-tab nav-tab_back nav-tab_view_button"
					href="../.."><span data-lego="react"
			                           class="icon icon_type_arrow-short icon_direction_left icon_size_s nav-tab__arrow-icon"></span><span
					class="nav-tab__inner">Урок Пробная СР</span></a>
				<nav class="yd407c--arrow-navigation">
						<a class="yd407c--arrow-navigation__arrow yd407c--arrow-navigation__arrow_direction_left"
						   href="../23127">
                    <span data-lego="react"
                          class="icon icon_type_scroll icon_direction_left icon_size_l"></span></a>
				</nav>
				<header class="yde1c4--task-header">
					<h1 class="heading heading_level_1 yde1c4--task-header__heading">Со всех ног</h1>
					<div class="y43a24--task-info__tag">
						<span class="task-tag task-tag_type_individual-work task-tag_size_m"></span>
						<div class="y43a24--task-info__tag-name">Самостоятельная работа</div>
					</div>
				</header>
				<section class="y6c2ac--task-description">
					<article class="y6c2ac--task-description__content">
						<!DOCTYPE html
  SYSTEM "html">
<div class="problem-statement">
   <div class="header">
      <h1 class="title">Со всех ног</h1>
      <table>
         <tr class="time-limit">
            <td class="property-title">Ограничение времени</td>
            <td>1&nbsp;секунда</td>
         </tr>
         <tr class="memory-limit">
            <td class="property-title">Ограничение памяти</td>
            <td>64Mb</td>
         </tr>
         <tr class="input-file">
            <td class="property-title">Ввод</td>
            <td colspan="1">стандартный ввод или input.txt</td>
         </tr>
         <tr class="output-file">
            <td class="property-title">Вывод</td>
            <td colspan="1">стандартный вывод или output.txt</td>
         </tr>
      </table>
   </div>
   <h2></h2>
   <div class="legend"><span style="">
         <p>Бильбо потом никак не мог вспомнить, каким образом очутился на улице — без шапки, без трости, без денег, без всех тех вещей,
            которые привык брать с собой, выходя из дому. Оставив второй завтрак недоеденным и посуду после себя невымытой, он побежал
            со всех своих мохнатых ног по улочке мимо большой мельницы, через мост и еще с милю По Ту Сторону Реки. <br></p>
         <p>Ну и запыхался же он, и упарился же, когда ровно в одиннадцать, с боем часов, достиг Байуотера. И на тебе! Оказалось, что
            носовой платок он тоже забыл дома! <br></p>
         <p>Напишите программу, которая проверит, сколько всего забыл Бильбо. А сделать это можно так: </p>
         <p>Если в строке есть слово <span style="font-weight:bold;">забыл</span> или то слово, что будет введено на второй строке, то строка считается. 
         </p>
         <p>Если таких строк с забытыми вещами не больше половины от всех введенных, то вывести НЕ ТАК И МНОГО, иначе вывести ВСЕ РАВНО
            НИЧЕГО СТРАШНОГО. 
         </p></span></div>
   <h2>Формат ввода</h2>
   <div class="input-specification"><span style="">
         <p>Вводится число &ndash; количество строк для проверки. </p>
         <p>Затем вводится проверочное слово. </p>
         <p>Затем вводятся строки для проверки </p></span></div>
   <h2>Формат вывода</h2>
   <div class="output-specification"><span style="">
         <p>В первой строке вывести НЕ ТАК И МНОГО или ВСЕ РАВНО НИЧЕГО СТРАШНОГО. </p>
         <p>Затем вывести сумму количеств всех введенных и подходящих строк. </p></span></div>
   <h3>Пример 1</h3>
   <table class="sample-tests">
      <thead>
         <tr>
            <th>Ввод</th>
            <th>Вывод</th>
         </tr>
      </thead>
      <tbody>
         <tr>
            <td><pre>5
плат
Бильбо не успел надеть шляпу.
Он не успел взять денег.
И не захватил носовой платок.
Придется вам обходиться без носовых платков и еще много без чего.
Самый маленький пони для Бильбо.
</pre></td>
            <td><pre>НЕ ТАК И МНОГО
7
</pre></td>
         </tr>
      </tbody>
   </table>
   <h3>Пример 2</h3>
   <table class="sample-tests">
      <thead>
         <tr>
            <th>Ввод</th>
            <th>Вывод</th>
         </tr>
      </thead>
      <tbody>
         <tr>
            <td><pre>4
шляп
Я забыл надеть шляпу.
А вместо шляпы... у меня в багаже есть лишний капюшон и плащ.
Бильбо утешался единственно тем, что его нельзя принять за гнома, так как у него нет бороды.
Однако, он не забыл, что его ждут приключения.
</pre></td>
            <td><pre>ВСЕ РАВНО НИЧЕГО СТРАШНОГО
7
</pre></td>
         </tr>
      </tbody>
   </table>
</div>
								<h2>Решение</h2>
								<a class="nav-tab nav-tab_back nav-tab_view_button"
								   href="https://yastatic.net/s3/lyceum/files/5eb36d7d-5fd4-444e-925e-d95716e322e7/solution.py"><span data-lego="react"
								                                   class="icon icon_type_arrow-short icon_direction_down icon_size_s nav-tab__arrow-icon"></span><span
										class="nav-tab__inner">Скачать</span></a>
									<details>
										<summary>Код</summary>
										<pre class="language-python" style="border-radius: 15px"><code
												class="language-python">n = int(input()) 
c = 0 
m = str(input()) 
for i in range(n): 
    a = str(input()) 
    if "забыл" in a or m in a: 
        c = c + 1 
if c > n / 2: 
    print("ВСЕ РАВНО НИЧЕГО СТРАШНОГО") 
else: 
    print("НЕ ТАК И МНОГО") 
print(n + c)</code></pre>
									</details>
							</article>
				</section>
			</main>
		</div>
		<aside class="layout__active-area">
			<nav class="yd609d--task-group-navigation">
				<ul class="yd609d--task-group-navigation__groups">
						<li class="yd609d--task-group-navigation__group"><span
								class="task-tag task-tag_type_individual-work task-tag_size_l yd609d--task-group-navigation__tag"
								tabindex="8"></span>
							<ul class="yd609d--task-group-navigation__tasks">
									<li class="yd609d--task-group-navigation__task">
											<a class="yd609d--task-group-navigation__link"
											   href="../23126">
												<div class="indicator indicator_color_grey indicator_size_xs"></div>
											</a>
									</li>
									<li class="yd609d--task-group-navigation__task">
											<a class="yd609d--task-group-navigation__link"
											   href="../23127">
												<div class="indicator indicator_color_grey indicator_size_xs"></div>
											</a>
									</li>
									<li class="yd609d--task-group-navigation__task">
											<a class="yd609d--task-group-navigation__link  yd609d--task-group-navigation__link_checked"
											   href="../23128">
												<div class="indicator indicator_color_grey indicator_size_xs"></div>
											</a>
									</li>
							</ul>
						</li>
				</ul>
			</nav>
		</aside>
	</div>
	<script src="/js/prism.js"></script>
</body>
</html>