<!-- Generated by https://github.com/rodion-gudz/YandexLyceumDocs -->

<!DOCTYPE html>
<html lang="ru">
<head>
    <meta charset="UTF-8">
    <title>Задача "Тот самый Гэндальф" </title>
    <link rel="stylesheet" href="/css/client.css"/>
	<link rel="stylesheet" href="/css/vendors.css">
	<link rel="stylesheet" href="/css/prism.css"/>
</head>
<body>
	<div class="layout">
		<div class="layout__wrapper layout__wrapper_type_narrow">
			<main class="layout__main"><a
					class="nav-tab nav-tab_back nav-tab_view_button"
					href="../.."><span data-lego="react"
			                           class="icon icon_type_arrow-short icon_direction_left icon_size_s nav-tab__arrow-icon"></span><span
					class="nav-tab__inner">Урок Пробная СР</span></a>
				<nav class="yd407c--arrow-navigation">
						<a class="yd407c--arrow-navigation__arrow yd407c--arrow-navigation__arrow_direction_right"
						   href="../23127">
                        <span data-lego="react"
                              class="icon icon_type_scroll icon_direction_right icon_size_l"></span></a>
				</nav>
				<header class="yde1c4--task-header">
					<h1 class="heading heading_level_1 yde1c4--task-header__heading">Тот самый Гэндальф</h1>
					<div class="y43a24--task-info__tag">
						<span class="task-tag task-tag_type_individual-work task-tag_size_m"></span>
						<div class="y43a24--task-info__tag-name">Самостоятельная работа</div>
					</div>
				</header>
				<section class="y6c2ac--task-description">
					<article class="y6c2ac--task-description__content">
						<!DOCTYPE html
  SYSTEM "html">
<div class="problem-statement">
   <div class="header">
      <h1 class="title">Тот самый Гэндальф</h1>
      <table>
         <tr class="time-limit">
            <td class="property-title">Ограничение времени</td>
            <td>1&nbsp;секунда</td>
         </tr>
         <tr class="memory-limit">
            <td class="property-title">Ограничение памяти</td>
            <td>64Mb</td>
         </tr>
         <tr class="input-file">
            <td class="property-title">Ввод</td>
            <td colspan="1">стандартный ввод или input.txt</td>
         </tr>
         <tr class="output-file">
            <td class="property-title">Вывод</td>
            <td colspan="1">стандартный вывод или output.txt</td>
         </tr>
      </table>
   </div>
   <h2></h2>
   <div class="legend"><span style="">
         <p>— Гэндальф! Боже милостивый, Гэндальф! Неужели вы тот самый странствующий волшебник, который подарил Старому Туку пару волшебных
            бриллиантовых запонок, — они еще застегивались сами, а расстегивались только по приказу? Тот, кто рассказывал на дружеских
            пирушках такие дивные истории про драконов и гоблинов, про великанов и спасенных принцесс? Тот самый, который устраивал такие
            неподражаемые фейерверки? Какое великолепие! Они взлетали кверху, точно гигантские огненные лилии, и львиный зев, и золотой
            дождь, и держались весь вечер в сумеречном небе! 
         </p>
         <p>Ну конечно, это он, тот самый волшебник Гэндальф! Напишите программу, которая во введенных строках будет искать что-то волшебное
            (достаточно проверить подстроку <span style="font-weight:bold;">волшебн</span>), а если найдет, то подсчитает суммарную длину таких волшебных строк.
         </p></span></div>
   <h2>Формат ввода</h2>
   <div class="input-specification"><span style="">
         <p>Вводятся строки, пока не будет введена строка, в которой есть <span style="font-weight:bold;">Гэндальф</span>.
         </p></span></div>
   <h2>Формат вывода</h2>
   <div class="output-specification"><span style="">
         <p>Вывести, сколько всего было символов в строках, в которых есть что-то <span style="font-weight:bold;">волшебн</span>ое.
         </p></span></div>
   <h3>Пример 1</h3>
   <table class="sample-tests">
      <thead>
         <tr>
            <th>Ввод</th>
            <th>Вывод</th>
         </tr>
      </thead>
      <tbody>
         <tr>
            <td><pre>Тот самый странствующий волшебник!
Подарил Старому Туку пару волшебных бриллиантовых запонок.
Истории про драконов и гоблинов.
Про великанов и спасенных принцесс.
Устраивал волшебные фейерверки.
И это все Гэндальф!
</pre></td>
            <td><pre>123
</pre></td>
         </tr>
      </tbody>
   </table>
   <h3>Пример 2</h3>
   <table class="sample-tests">
      <thead>
         <tr>
            <th>Ввод</th>
            <th>Вывод</th>
         </tr>
      </thead>
      <tbody>
         <tr>
            <td><pre>Это Вы, по чьей милости столько тихих юношей и девушек пропали невесть куда, отправившись на поиски приключений?
Любых: от лазанья по деревьям до визитов к эльфам.
Они даже уплывали на кораблях к чужим берегам!
И это снова он, Гэндальф.
</pre></td>
            <td><pre>0
</pre></td>
         </tr>
      </tbody>
   </table>
</div>
								<h2>Решение</h2>
								<a class="nav-tab nav-tab_back nav-tab_view_button"
								   href="https://yastatic.net/s3/lyceum/files/362871c3-fec7-4edb-b804-10239098ad51/solution.py"><span data-lego="react"
								                                   class="icon icon_type_arrow-short icon_direction_down icon_size_s nav-tab__arrow-icon"></span><span
										class="nav-tab__inner">Скачать</span></a>
									<details>
										<summary>Код</summary>
										<pre class="language-python" style="border-radius: 15px"><code
												class="language-python">a = str(input()) 
n = 1 
b = 0 
if "волшебн" in a: 
    b = b + len(a) 
while "Гэндальф" not in a: 
    a = str(input()) 
    n = n + 1 
    if "волшебн" in a: 
        b = b + len(a) 
print(b)</code></pre>
									</details>
							</article>
				</section>
			</main>
		</div>
		<aside class="layout__active-area">
			<nav class="yd609d--task-group-navigation">
				<ul class="yd609d--task-group-navigation__groups">
						<li class="yd609d--task-group-navigation__group"><span
								class="task-tag task-tag_type_individual-work task-tag_size_l yd609d--task-group-navigation__tag"
								tabindex="8"></span>
							<ul class="yd609d--task-group-navigation__tasks">
									<li class="yd609d--task-group-navigation__task">
											<a class="yd609d--task-group-navigation__link  yd609d--task-group-navigation__link_checked"
											   href="../23126">
												<div class="indicator indicator_color_grey indicator_size_xs"></div>
											</a>
									</li>
									<li class="yd609d--task-group-navigation__task">
											<a class="yd609d--task-group-navigation__link"
											   href="../23127">
												<div class="indicator indicator_color_grey indicator_size_xs"></div>
											</a>
									</li>
									<li class="yd609d--task-group-navigation__task">
											<a class="yd609d--task-group-navigation__link"
											   href="../23128">
												<div class="indicator indicator_color_grey indicator_size_xs"></div>
											</a>
									</li>
							</ul>
						</li>
				</ul>
			</nav>
		</aside>
	</div>
	<script src="/js/prism.js"></script>
</body>
</html>